---
type: StructuralWallUsageFilter
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 3
tags: [revit-api, class]
---

# StructuralWallUsageFilter

`Autodesk.Revit.DB.Structure.StructuralWallUsageFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralWallUsageFilter | — | `` |
| Method | PassesFilter | — | `` |
| Property | StructuralWallUsage | 2011 | `public StructuralWallUsage StructuralWallUsage { get ; }` |